## Topicos Conteporânios em Finanças - Ciência de dados
#### Departamento de Administração - UnB (2021/2)

### The Data Analysis Process

The data analysis process can be generalized in the steps belows (Data Analysis with Python. freeCodeCamp, 2020):

1. Data Extraction
    1. SQL, csv, xlsx, scrapping, APIs.
2. Data Cleaning
    1. Missing values, incorrect types, invalid values, outliers.
3. Data Wrangling
    1. Reshape data frame, merging and joining, create classes.
4. Analysis
    1. Data exploration, visualization, correlation, hypothesis testing.
5. Action
    1. Machine Learning, Feature Engineering, production, dashboard.
6. Decision making

##### There are two python libraries widely used for data analysis that we are going to look: `numpy` and `pandas`.

`numpy` stands for 'numerical python' and provide us many resources for numerical operations. On the other hand, `pandas` gives us many powerfull tools to work with data frames for data analysis. We use `import` to call the library (e.g. `numpy` and `pandas)` and '_as_' np/pd justo to make it simplier to write our code when we need them. As we further advance in our data analysis we will learn how to use some handy functions available. Here is how we call them:

In [2]:
import numpy  as np
import pandas as pd

In [23]:
{
    "tags": [
        "remove-cell"
    ]
}

# Display only 2 decimals on pandas data frames
pd.options.display.float_format = '{:.2f}'.format

# Display all cell results (not only last one)
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

{'tags': ['remove-cell']}

### German Credit Analysis

For our first analysis, we will use a credit risk dataset avilable on [kaggle](https://www.kaggle.com/laotse/credit-risk-dataset/version/1).
We will read the csv file to a dataframe object, called 'dados' and do some basic inspections to see what kind of information are we dealing with. To read the csv file we use `pd.read_csv()` (function *read_csv* from _pandas_). Since the file its in our own working directory, we only need to provide its first parameter, that is the file location and name (with extension, e.g. 'csv'). If needed to specify other paremeters like decimals and separators, you can take a look at the function [documentation](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html).

In [6]:
# help(pd.read_csv) ; display documentation 
dados = pd.read_csv('credit_risk_dataset.csv')

Once the data is loaded we run some basic operations just to check it `type`, the columns names and the number of rows/columns with the methods `columns` and `shape`, respectively.

In [12]:
# Check object type
print('\nType:')
type(dados)

# Get column names
print('\nColumn names:')
dados.columns

# number of rows and columns
print('\nNumber of rows and columns:')
dados.shape

Type:

pandas.core.frame.DataFrame

Column names:

Index(['person_age', 'person_income', 'person_home_ownership',
       'person_emp_length', 'loan_intent', 'loan_grade', 'loan_amnt',
       'loan_int_rate', 'loan_status', 'loan_percent_income',
       'cb_person_default_on_file', 'cb_person_cred_hist_length'],
      dtype='object')

Number of rows and columns:

(32581, 12)

We can also take a general look at the dataset with the method `info()`. The type of variable stored in each column is given by 'Dtype', where 'int64' means integer, float64 decimals and object 'strings'.

In [8]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32581 entries, 0 to 32580
Data columns (total 12 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   person_age                  32581 non-null  int64
 1   person_income               32581 non-null  int64
 2   person_home_ownership       32581 non-null  object
 3   person_emp_length           31686 non-null  float64
 4   loan_intent                 32581 non-null  object
 5   loan_grade                  32581 non-null  object
 6   loan_amnt                   32581 non-null  int64
 7   loan_int_rate               29465 non-null  float64
 8   loan_status                 32581 non-null  int64
 9   loan_percent_income         32581 non-null  float64
 10  cb_person_default_on_file   32581 non-null  object
 11  cb_person_cred_hist_length  32581 non-null  int64
dtypes: float64(3), int64(5), object(4)
memory usage: 3.0+ MB

#### Really looking at the dataset

Let's take a look at the values stored in our dataset. Using `head()` we can display just the first rows (or last with, *tail()*) of our data frame.

In [13]:
# display first 'n' observations
dados.head(5)

,person_age,person_income,person_home_ownership,person_emp_length,loan_intent,loan_grade,loan_amnt,loan_int_rate,loan_status,loan_percent_income,cb_person_default_on_file,cb_person_cred_hist_length
0,22,59000,RENT,123.00,PERSONAL,D,35000,16.02,1,0.59,Y,3
1,21,9600,OWN,5.00,EDUCATION,B,1000,11.14,0,0.10,N,2
2,25,9600,MORTGAGE,1.00,MEDICAL,C,5500,12.87,1,0.57,N,3
3,23,65500,RENT,4.00,MEDICAL,C,35000,15.23,1,0.53,N,2
4,24,54400,RENT,8.00,MEDICAL,C,35000,14.27,1,0.55,Y,4

#### Getting some information

Now, it's time to extract some information and see how things are going. One way to go is to perform some calculations on quantitative variables and check some frequencies on categorical ones.

In [10]:
# general measures on quantiative variables
dados.describe()

,person_age,person_income,person_emp_length,loan_amnt,loan_int_rate,loan_status,loan_percent_income,cb_person_cred_hist_length
count,32581.00,32581.00,31686.00,32581.00,29465.00,32581.00,32581.00,32581.00
mean,27.73,66074.85,4.79,9589.37,11.01,0.22,0.17,5.80
std,6.35,61983.12,4.14,6322.09,3.24,0.41,0.11,4.06
min,20.00,4000.00,0.00,500.00,5.42,0.00,0.00,2.00
25%,23.00,38500.00,2.00,5000.00,7.90,0.00,0.09,3.00
50%,26.00,55000.00,4.00,8000.00,10.99,0.00,0.15,4.00
75%,30.00,79200.00,7.00,12200.00,13.47,0.00,0.23,8.00
max,144.00,6000000.00,123.00,35000.00,23.22,1.00,0.83,30.00

##### We also can look at class frequencies in a qualitative variable. If we use __normalize__ argument, the result is percentage values (adding up to 1).

In [18]:
# Frequency
print('\nAbsolute Frequency')
dados['person_home_ownership'].value_counts()

# Percentage
print('\nRelative Frequency')
dados.person_home_ownership.value_counts(normalize=True)

Absolute Frequency

RENT        16446
MORTGAGE    13444
OWN          2584
OTHER         107
Name: person_home_ownership, dtype: int64

Relative Frequency

RENT       0.50
MORTGAGE   0.41
OWN        0.08
OTHER      0.00
Name: person_home_ownership, dtype: float64

```{note}
Although we got an 0.00% relative frequency on the calss 'OTHER', we can see that it is actually around 0.33%
```

In [22]:
print("\n Percentage of class 'OTHER':")
sum(dados['person_home_ownership'] == "OTHER") / dados.shape[0] * 100

 Percentage of class 'OTHER':

0.3284122648169179

##### It is also interesting to look to look at some cross frequencies. By default, the virst variable is considered by row.

In [25]:
print('\nFrequency count\n')
pd.crosstab(dados.loan_intent, dados.loan_grade)

Frequency count

loan_grade            A     B     C    D    E   F   G
loan_intent
DEBTCONSOLIDATION  1753  1620  1042  600  144  43  10
EDUCATION          2174  2026  1356  657  185  46   9
HOMEIMPROVEMENT    1126  1115   693  487  143  32   9
MEDICAL            1959  2006  1217  658  167  52  12
PERSONAL           1832  1813  1046  643  147  30  10
VENTURE            1933  1871  1104  581  178  38  14

##### When normalizing a contingency table whe can get percentages by row, column or by the overall sum.

In [27]:
print('\nPercentages by row\n')
pd.crosstab(dados.loan_intent, dados.loan_grade, normalize='index') * 100

print('\nPercentages by column\n')
pd.crosstab(dados.loan_intent, dados.loan_grade, normalize='columns') * 100

print('\nPercentages by overall sum\n')
pd.crosstab(dados.loan_intent, dados.loan_grade, normalize='all') * 100

Percentages by row

loan_grade            A     B     C     D    E    F    G
loan_intent
DEBTCONSOLIDATION 33.63 31.08 19.99 11.51 2.76 0.83 0.19
EDUCATION         33.69 31.40 21.01 10.18 2.87 0.71 0.14
HOMEIMPROVEMENT   31.23 30.93 19.22 13.51 3.97 0.89 0.25
MEDICAL           32.27 33.04 20.05 10.84 2.75 0.86 0.20
PERSONAL          33.18 32.84 18.95 11.65 2.66 0.54 0.18
VENTURE           33.80 32.72 19.30 10.16 3.11 0.66 0.24

Percentages by column

loan_grade            A     B     C     D     E     F     G
loan_intent
DEBTCONSOLIDATION 16.27 15.50 16.14 16.55 14.94 17.84 15.62
EDUCATION         20.17 19.39 21.00 18.12 19.19 19.09 14.06
HOMEIMPROVEMENT   10.45 10.67 10.73 13.43 14.83 13.28 14.06
MEDICAL           18.18 19.19 18.84 18.15 17.32 21.58 18.75
PERSONAL          17.00 17.35 16.20 17.73 15.25 12.45 15.62
VENTURE           17.94 17.90 17.10 16.02 18.46 15.77 21.88

Percentages by overall sum

loan_grade           A    B    C    D    E    F    G
loan_intent
DEBTCONSOLIDATION 5.38 4.97 3.20 1.84 0.44 0.13 0.03
EDUCATION         6.67 6.22 4.16 2.02 0.57 0.14 0.03
HOMEIMPROVEMENT   3.46 3.42 2.13 1.49 0.44 0.10 0.03
MEDICAL           6.01 6.16 3.74 2.02 0.51 0.16 0.04
PERSONAL          5.62 5.56 3.21 1.97 0.45 0.09 0.03
VENTURE           5.93 5.74 3.39 1.78 0.55 0.12 0.04

##### Calculating summary statistics for a specific feature.

In [28]:
dados['person_income'].mean()
dados.person_income.std()

66074.84846996715

61983.119168159064

##### Simple data frame with income mean and standard deviation.

In [29]:
media  = dados['person_income'].mean()
desvio = dados['person_income'].std()

pd.DataFrame([ ['income', media, desvio] ], columns=['Variable', 'Mean', 'Std'])

pd.DataFrame([ ['renda anual', media, desvio] ], columns=['Variavel', 'Media', 'Desvio'] )

  Variable     Mean      Std
0   income 66074.85 61983.12

      Variavel    Media   Desvio
0  renda anual 66074.85 61983.12

##### From an exploratory perspective, it's also helpful to look at summary statistics by classes of interest. For example, we can take a look if the average interest rate seems to be change among loan grades

In [35]:
dados.groupby(['loan_grade'])['loan_int_rate'].mean()
dados.groupby(['loan_grade'])['loan_int_rate'].std()

loan_grade
A    7.33
B   11.00
C   13.46
D   15.36
E   17.01
F   18.61
G   20.25
Name: loan_int_rate, dtype: float64

loan_grade
A   1.04
B   0.91
C   0.96
D   1.11
E   1.32
F   1.38
G   1.07
Name: loan_int_rate, dtype: float64

##### For a better visualization we can build a simple data frame, just like 'person_income' example a above.

In [8]:
juros_nota_me = dados.groupby(['loan_grade'])['loan_int_rate'].mean()
juros_nota_sd = dados.groupby(['loan_grade'])['loan_int_rate'].std()

pd.DataFrame([juros_nota_me, juros_nota_sd])

loan_grade       A     B     C     D     E     F     G
loan_int_rate 7.33 11.00 13.46 15.36 17.01 18.61 20.25
loan_int_rate 1.04  0.91  0.96  1.11  1.32  1.38  1.07

In [51]:
#pd.DataFrame([juros_nota_me, juros_nota_sd])
juros_nota_me.rename('mean_int')

loan_grade
A    7.33
B   11.00
C   13.46
D   15.36
E   17.01
F   18.61
G   20.25
Name: mean_int, dtype: float64

##### Another option is to use 'pd.concat' to concatenate them. The argument 'axis=1' tells that they will be binded as columns. However, we must pay atention to columns names (once we do not want two columns with equal names). With that said, whats the difference between the two dataframes below?

In [53]:
pd.concat([juros_nota_me.rename('int_mean'), juros_nota_sd.rename('int_sd')], axis=1)
pd.concat([juros_nota_me.rename('int_mean'), juros_nota_sd.rename('int_sd')], axis=1).reset_index()

            int_mean  int_sd
loan_grade
A               7.33    1.04
B              11.00    0.91
C              13.46    0.96
D              15.36    1.11
E              17.01    1.32
F              18.61    1.38
G              20.25    1.07

  loan_grade  int_mean  int_sd
0          A      7.33    1.04
1          B     11.00    0.91
2          C     13.46    0.96
3          D     15.36    1.11
4          E     17.01    1.32
5          F     18.61    1.38
6          G     20.25    1.07

#### Indexing

##### Indexing ends up being very handy, for it allows us to select specific rows (or columns).

In [54]:
df1 = pd.concat([juros_nota_me.rename('int_mean'), juros_nota_sd.rename('int_sd')], axis=1)
df2 = pd.concat([juros_nota_me.rename('int_mean'), juros_nota_sd.rename('int_sd')], axis=1).reset_index()

In [55]:
df1.index
df2.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object', name='loan_grade')

RangeIndex(start=0, stop=7, step=1)

In [57]:
df1.iloc[0]
df2.iloc[0]

int_mean   7.33
int_sd     1.04
Name: A, dtype: float64

loan_grade      A
int_mean     7.33
int_sd       1.04
Name: 0, dtype: object

In [58]:
df1.loc['A']
df2.loc[0]

int_mean   7.33
int_sd     1.04
Name: A, dtype: float64

loan_grade      A
int_mean     7.33
int_sd       1.04
Name: 0, dtype: object

#### We could see an important difference between these two indexing methods.
* loc returns rows with their particular labels
* iloc returns rows at integer locations

In [59]:
print('\ndf2.iloc[0:2]\n')
df2.iloc[0:2]

print('\ndf2.iloc[0:4]\n')
df2.iloc[0:4]

print('\ndf2.iloc[2:4]\n')
df2.iloc[2:4]

df2.iloc[0:2]

  loan_grade  int_mean  int_sd
0          A      7.33    1.04
1          B     11.00    0.91

df2.iloc[0:4]

  loan_grade  int_mean  int_sd
0          A      7.33    1.04
1          B     11.00    0.91
2          C     13.46    0.96
3          D     15.36    1.11

df2.iloc[2:4]

  loan_grade  int_mean  int_sd
2          C     13.46    0.96
3          D     15.36    1.11

#### Hence, if we want build a new data frame by filtering some values, it is often interesting that this new data frame has it's own index range. For this purpose we use 'reset_index()' when appropirate.

In [72]:
df1_filter = df1[ df1.int_sd >= 1 ]
df2_filter = df2[ df2.int_sd >= 1 ]

In [73]:
df1_filter
df2_filter

            int_mean  int_sd
loan_grade
A               7.33    1.04
D              15.36    1.11
E              17.01    1.32
F              18.61    1.38
G              20.25    1.07

  loan_grade  int_mean  int_sd
0          A      7.33    1.04
3          D     15.36    1.11
4          E     17.01    1.32
5          F     18.61    1.38
6          G     20.25    1.07

In [75]:
df2_filter.iloc[0:2]

  loan_grade  int_mean  int_sd
0          A      7.33    1.04

In [34]:
type(df1)
type(df2)

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame